In [74]:
#y=mx1+mx2+mx3+......+b

In [75]:
from word2number import w2n

# pip install word2number

In [76]:
import pandas as pd
import numpy as np
from sklearn import linear_model

In [77]:
df=pd.read_csv('hiring.csv')

In [78]:
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [79]:
# removing nan in experience and fill with zero

In [80]:
df.experience=df.experience.fillna('zero')
df.head()

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0       zero                    8.0                           9      50000
1       zero                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000

In [81]:
# changing to numbers using word2number py
#>>> print w2n.word_to_num("two million three thousand nine hundred and eighty four")
#2003984


df.experience = df.experience.apply(w2n.word_to_num)
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    NaN                           7      72000
7          11                    7.0                           8      80000

In [82]:
import math

In [83]:
m_test=math.floor(df['test_score(out of 10)'].mean())
m_test

# because of unusual bracets

7

In [84]:
df['test_score(out of 10)'] = df['test_score(out of 10)'].fillna(m_test)
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    7.0                           7      72000
7          11                    7.0                           8      80000

In [85]:
reg = linear_model.LinearRegression()
reg.fit(df.drop((['salary($)']),axis="columns"),df['salary($)'])

# Because of weird bracets

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [86]:
reg.predict([[2,9,6]])

array([53713.86677124])

In [ ]:
# Linear Regression Multiple variable